// ДЗ1
//Задача 2: Напишите программу, которая на вход принимает два числа 
//и выдаёт, какое число большее, а какое меньшее.
/*

Console.Write("Input a first number: ");
int a = Convert.ToInt32(Console.ReadLine());
Console.Write("Input a second number: ");
int b = Convert.ToInt32(Console.ReadLine());

if (a == b) Console.Write("two numbers are equal");

else
{
    int max = a;
    if (a < b) max = b;
    Console.Write("max = " + max); 
}

*/





